[source::...*ta_symantec-ep.log]
sourcetype = ta_symantec-ep



[symantec:ep:agt_system:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection client agent system events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_system = field_extraction_for_agt_system

# Purpose for below "EVAL": trim ' or " from field value.
EVAL-Event_Description = nullif(trim(Event_Description, "\"'"), "")
LOOKUP-vendor_severity_to_severity = symantec_ep_severity_lookup vendor_severity OUTPUT severity
EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:scm_system:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection server system events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_scm_system = field_extraction_for_scm_system

# Purpose for below "EVAL": trim ' or " from field value.
EVAL-Event_Description = nullif(trim(Event_Description, "\"'"), "")
EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:agent:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection server client agent events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agent_act = field_extraction_for_agent_act

# Purpose for below "EVAL": trim ' or " from field value.
EVAL-user = nullif(trim(user, "\"'"), "")

######## For CIM Mapping ##########
FIELDALIAS-src = Host_Name as src
FIELDALIAS-dest = Server_Name as dest
FIELDALIAS-dvc = Server_Name as dvc
LOOKUP-vendor_action_for_agent_act = symantec_ep_admin_action_lookup vendor_action as Event_Description OUTPUT action, change_type
EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:behavior:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent behavior events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_behavior = field_extraction_for_agt_behavior, process_from_caller_process_name, caller_md5_from_description
FIELDALIAS-vendor_action_SEP_behavior_vendor_action = vendor_action as SEP_behavior_vendor_action

# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"), "\"'"), ","), "")

# For the case: "Rule: Allow ping, pong and tracert"
EVAL-rule = nullif(trim(replace(rule, "[^:]+:\s*(.*)", "\1"), "\"'"), "")
EVAL-Description = nullif(trim(Description, "\"'"), "")

###### For CIM mapping #########
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-Host_Name_dest = Host_Name as dest
EVAL-signature = if(vendor_action =="Blocked", if(match(Description, "Block\saccess\sto\sautorun\.inf"), if(isnotnull(Caller_MD5), "Drive Autorun (Caller MD5=" + Caller_MD5+")", "Drive Autorun"), nullif(trim(Description, "\"'"), "")), null)
LOOKUP-vendor_action_to_action = symantec_ep_action_lookup vendor_action as SEP_behavior_vendor_action OUTPUT action action as SEP_behavior_action
LOOKUP-vendor_severity_to_severity = symantec_ep_severity_lookup vendor_severity OUTPUT severity
FIELDALIAS-Device_ID_dvc = Device_ID as dvc
FIELDALIAS-Domain_Name_dest_nt_domain = Domain_Name as dest_nt_domain


[symantec:ep:risk:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent risk events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_risk = field_extraction_for_agt_risk, filename_from_filepath
FIELDALIAS-SEP_risk_signature = Risk_Name as SEP_risk_signature

# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"), "\"'"), ","), "")

# trim the quotation marks
EVAL-Description = nullif(trim(Description, "\"'"), "")

# For the case "Field: null" set the field to be null.
EVAL-Web_Domain = if(Web_Domain=="" OR Web_Domain=="null", null, Web_Domain)
EVAL-Downloaded_By = if(Downloaded_By=="null" OR Downloaded_By=="", null, Downloaded_By)
EVAL-Download_Site = if(Download_Site=="null" OR Download_Site=="", null, Download_Site)
EVAL-url = if(Download_Site=="null" OR Download_Site=="", null, Download_Site)

###### For CIM mapping #######
EVAL-date = nullif(replace(Event_Time, "\s*(\S+)\s.*", "\1"), "")
FIELDALIAS-signature = Risk_Name as signature
FIELDALIAS-file_hash = Application_Hash as file_hash
FIELDALIAS-file_hash_type = Hash_Type as file_hash_type
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-src = Source_Computer_Name as src
FIELDALIAS-src_ip = Source_Computer_IP as src_ip
FIELDALIAS-dest = Computer_Name as dest
FIELDALIAS-dest_nt_domain = Domain_Name as dest_nt_domain
FIELDALIAS-dest_ip = IP_Address as dest_ip
LOOKUP-risk_vendor_action_to_action = symantec_ep_action_lookup vendor_action OUTPUT action
LOOKUP-risk_category_lookup = symantec_ep_malware_category_lookup title as SEP_risk_signature OUTPUT type as category  riskLevel as Risk_Level type as SEP_risk_category riskLevel as SEP_Risk_Level



[symantec:ep:security:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent security events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_security = field_extraction_for_agt_security, category_from_description

# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"), "\"'"), ","), "")
# Trim quotation marks
EVAL-Event_Description = nullif(trim(Event_Description, "\"'"), "")
EVAL-category = nullif(trim(category, "\"'"), "")

##### For CIM mappimng ######## 
FIELDALIAS-dvc = host as dvc
EVAL-direction = lower(Traffic_Direction)
EVAL-dest = if(Traffic_Direction=="Inbound", Local_Host_IP, Remote_Host_IP)
EVAL-src = if(Traffic_Direction=="Outbound", Local_Host_IP, Remote_Host_IP)
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-signature = CIDS_Signature_String as signature
EVAL-ids_type = "host"
EVAL-action = case(match(Event_Description, "block"), "blocked", 1==1, "allowed")
LOOKUP-vendor_severity_to_severity = symantec_ep_severity_lookup vendor_severity OUTPUT severity



[symantec:ep:scan:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent scan events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_scan = field_extraction_for_agt_scan
FIELDALIAS-SEP_Scan_Infected_Files = Infected_Files as SEP_Scan_Infected_Files
EVAL-Start_Message = nullif(trim(Start_Message, "\"'"), "")
EVAL-Stop_Message = nullif(trim(Stop_Message, "\"'"), "")

##### For CIM mapping ######
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-dest = Computer_Name as dest
FIELDALIAS-dest_ip = IP_Address as dest_ip
FIELDALIAS-dest_nt_domain = Domain_Name as dest_nt_domain


[symantec:ep:proactive:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent proactive events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_proactive = field_extraction_for_agt_proactive, filename_from_filepath
EVAL-Detection_Source = if(Detection_Source=="" OR Detection_Source=="N/A", null, Detection_Source)
EVAL-Web_Domain = if(Web_Domain=="" OR Web_Domain=="null", null, Web_Domain)
EVAL-Downloaded_By = if(Downloaded_By=="null" OR Downloaded_By=="", null, Downloaded_By)
EVAL-Download_Site = if(Download_Site=="null" OR Download_Site=="", null, Download_Site)
EVAL-url = if(Download_Site=="null" OR Download_Site=="", null, Download_Site)
FIELDALIAS-category = Detection_Type as category

# trim the quotation marks
EVAL-Description = nullif(trim(Description, "\"'"), "")
EVAL-Application_Version = nullif(trim(Application_Version, "\"'"), "")

# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"), "\"'"), ","), "")

##### For CIM mapping #######
EVAL-date = nullif(replace(Event_Time, "\s*(\S+)\s.*", "\1"), "")
FIELDALIAS-signature = Application_Type as signature
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-src = Source_Computer_Name as src
FIELDALIAS-src_ip = Source_Computer_IP as src_ip
FIELDALIAS-dest = Computer_Name as dest
FIELDALIAS-dest_nt_domain = Domain_Name as dest_nt_domain
FIELDALIAS-file_hash = Application_Hash as file_hash
FIELDALIAS-file_hash_type = Hash_Type as file_hash_type
LOOKUP-proactive_vendor_action_to_action = symantec_ep_action_lookup vendor_action OUTPUT action



[symantec:ep:admin:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection server admin events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_admin = field_extraction_for_admin
EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:policy:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection server policy events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_policy = field_extraction_for_policy
EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-Policy_Name = nullif(trim(Policy_Name, "\"'"), "")


[symantec:ep:packet:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection client packet events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_packet = field_extraction_for_packet
EVAL-vendor_product = "Symantec Endpoint Protection"


[symantec:ep:traffic:file]
TRANSFORMS-nullqueueheader = sep_file_header
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent traffic events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_traffic = field_extraction_for_traffic
FIELDALIAS-SEP_Traffic_Direction = Traffic_Direction as SEP_Traffic_Direction
FIELDALIAS-SEP_traffic_vendor_action = vendor_action as SEP_traffic_vendor_action

# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"), "\"'"), ","), "")

# For the case: "Rule: Allow ping, pong and tracert"
EVAL-rule = nullif(trim(replace(rule, "[^:]+:\s*(.*)", "\1"), "\"'"), "")

##### For CIM mapping #######
####### fields for both 'Network Traffic' and IDS model #####
FIELDALIAS-dvc_from_host_for_sep = host as dvc
LOOKUP-symantec_ep_vendor_action_lookup_for_traffic_file = symantec_ep_action_lookup vendor_action as SEP_traffic_vendor_action OUTPUT action action as SEP_traffic_action

######## fields for 'Network Traffic' model ##########
EVAL-direction = lower(Traffic_Direction)
EVAL-dest_ip = if(Traffic_Direction=="Inbound", Local_Host_IP, Remote_Host_IP)
EVAL-src_ip = if(Traffic_Direction=="Outbound", Local_Host_IP, Remote_Host_IP)

EVAL-dest = if(Traffic_Direction=="Inbound", if(Host_Name=="" OR isnull(Host_Name), Local_Host_IP, Host_Name), if(Remote_Host_Name=="" OR isnull(Remote_Host_Name), Remote_Host_IP, Remote_Host_Name))
EVAL-src = if(Traffic_Direction=="Outbound", if(Host_Name=="" OR isnull(Host_Name), Local_Host_IP, Host_Name), if(Remote_Host_Name=="" OR isnull(Remote_Host_Name), Remote_Host_IP, Remote_Host_Name))

EVAL-dest_port = if(Traffic_Direction=="Inbound", Local_Port, Remote_Port)
EVAL-src_port = if(Traffic_Direction=="Outbound", Local_Port, Remote_Port)

EVAL-dest_mac = if(Traffic_Direction=="Outbound", lower(replace(Remote_Host_MAC, "(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")), lower(replace(Local_Host_MAC, "(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")))
EVAL-src_mac = if(Traffic_Direction=="Inbound", lower(replace(Remote_Host_MAC, "(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")), lower(replace(Local_Host_MAC, "(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")))

EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-protocol = if(Network_Protocol=="ICMP" OR isint(Network_Protocol), "icmp", "ip")
EVAL-icmp_type_code = if(isint(Network_Protocol), Network_Protocol, null)
LOOKUP-symantec_ep_icmp_type = symantec_ep_icmp_type_lookup icmp_type_code OUTPUT icmp_type_name
EVAL-transport = if(Network_Protocol=="TCP", "tcp", if(Network_Protocol=="UDP", "udp", "unknown"))
EVAL-duration = strptime(End_Time, "%Y-%m-%d %H:%M:%S")-strptime(Begin_Time, "%Y-%m-%d %H:%M:%S")

##### fields for IDS model (The inbound blocked events is mapped to IDS) #####
EVAL-category =  if(Traffic_Direction=="Inbound" AND match(vendor_action, "[Bb]lock"), "traffic", null)
EVAL-ids_type = if(Traffic_Direction=="Inbound" AND match(vendor_action, "[Bb]lock"), "host", null)
LOOKUP-symantec_ep_severity_lookup_for_traffic_file = symantec_ep_severity_lookup vendor_severity OUTPUT severity
EVAL-signature = if(Traffic_Direction=="Inbound" AND match(vendor_action, "[Bb]lock"), nullif(replace(rule, "[^:]+:\s*(.*)", "\1"), ""), null)